Repository: nukdokplex/nukdokplex-cogs
Catalog: leagueoflegends/locales/*.po
Languages: ru_ru

source: Ranked Solo 5 vs. 5
ru_ru: Соло 5 на 5

source: Ranked Flex SR
ru_ru: Гибкая СР

source: Ranked Flex TT
ru_ru: Гибкая ТТ

source: LeagueOfLegends API related commands.
ru_ru: Команды Лиги Легенд.

source: Leaderboard for {queue} queue
ru_ru: Топ игроков на {queue}

source: Error! League Of Legends ``api_key`` is not provided! Set it by ``[p]set api leagueoflegends api_key,[YOUR API TOKEN]``.
ru_ru: Ошибка! ``Ключ API`` Лиги Легенд не был установлен! установите его с помощью этой команды ``[p]set api leagueoflegends api_key,[ВАШ КЛЮЧ]``.

source: League of Legends related commands
ru_ru: Команды Лиги Легенд

source: Resets the League of Legends app cache
ru_ru: Сбрасывает кэш приложения Лиги Легенд

source: The League of Legends app cache was successfully reset!
ru_ru: Кэш приложения Лиги Легенд был успешно сброшен!

source: Sets the "Summoner name" for the user
ru_ru: Устанавливает "Имя призывателя" для пользователя

source: Send a proper ``Summoner name``
ru_ru: Отправьте корректное ``Имя призывателя``

source: Time is out. Cancelled.
ru_ru: Время вышло. Отменено.

source: Your name is set as "{name}"
ru_ru: Ваше имя было установлено как "{name}"

source: Sets the region for the user
ru_ru: Устанавливает регион пользователя

source: Europe West
ru_ru: Западная Европа

source: Europe Nordic & East
ru_ru: Северная и Восточная Европа

source: North America
ru_ru: Северная Америка

source: Brazil
ru_ru: Бразилия

source: Russia
ru_ru: Россия

source: Turkey
ru_ru: Турция

source: Oceania
ru_ru: Океания

source: Latin America North
ru_ru: Северная Латинская Америка

source: Latin America South
ru_ru: Южная Латинская Америка

source: Japan
ru_ru: Япония

source: Philippine
ru_ru: Филиппины

source: Singapore
ru_ru: Сингапур

source: Thailand
ru_ru: Тайланд

source: Taiwan
ru_ru: Тайвань

source: Vietnam
ru_ru: Вьетнам

source: Send a proper ``Region code`` e.g.:
ru_ru: Отправьте корректный ``Код региона``, например:

source: This is not valid ``Region code``!
ru_ru: Это не корректный ``Код региона``!

source: Your region has been set as ``{region_code}`` ({region_name})
ru_ru: Ваш регион был установлен как ``{region_code}`` ({region_name})

source: Returns stats of provided user
ru_ru: Возвращает статистику этого пользователя

source: You did not set a ``Summoner name``! You can do this with this command: ``{prefix}lol setname``
ru_ru: Вы не установили ``Имя призывателя``! Сделайте это с помощью команды: ``{prefix}lol setname``

source: You did not set a ``Region``! You can do this with this command: ``{prefix}lol setregion``
ru_ru: Вы не установили ``Регион``! Сделайте это с помощью команды: ``{prefix}lol setregion``

source: Got error while getting summoner's stats!
ru_ru: Произошла ошибка при попытке получения статистики призывателя!

source: Summoner not found!
ru_ru: Призыватель не найден!

source: Unfortunately, can't get your stats because the Riot API quota was fully used. The quota will be restored in ``{seconds} seconds``.
ru_ru: К сожалению, не можем получить вашу статистику, потому что квота Riot API была полностью использована. Квота будет восстановлена через ``{seconds} секунд``.

source: Couldn't get your stats because API key expired or cancelled.
ru_ru: Не удалось получить статистику из-за истечения срока действия или отмены ключа API.

source: Summoner statistics
ru_ru: Статистика призывателя

source: Level
ru_ru: Уровень

source: League of Legends RED Cog developed by NukDokPlex using RiotWatcher wrapper
ru_ru: Шестерня Лиги Легенл для RED была разработана NukDokPlex, используя RiotWatcher враппер

source: Statistics for {queue_type}
ru_ru: Статистика для {queue_type}

source: Tier
ru_ru: Класс

source: Rank
ru_ru: Ранк

source: League points
ru_ru: Очки Лиги

source: Wins
ru_ru: Победы

source: Losses
ru_ru: Поражение

source: Winrate
ru_ru: Винрейт

source: Veteran
ru_ru: Ветеран

source: Inactive
ru_ru: Неактивный

source: Fresh Blood
ru_ru: Свежая кровь

source: Hot Streak
ru_ru: Хот-стрик

source: Status
ru_ru: Статус

source: Setup League Of Legends leaderboard in server
ru_ru: Устанавливает лидерборд Лиги Легенд на сервер

source: You selected <#{channel}> channel. This channel will now update the leaderboard every hour with users who have already set their ``Summoner name`` and ``Region``. To set it, use the commands ``{prefix}lol setname`` and ``{prefix}lol setregion``. Only correct ones will be added to the leaderboard!
ru_ru: Вы выбрали <#{channel}> в качестве текстового канала. Это канал будет получать обновления лидерборда каждый час, в который войдут пользователи, которые уже установили свои ``Имя призывателя`` и ``Регион``. Чтобы установить их, используйте команды ``{prefix}lol setname`` и ``{prefix}lol setregion``. Только корректные будут добавлены в лидерборд!

source: Enables League Of Legends leaderboard for this guild
ru_ru: Включает лидерборд Лиги Легенд на этом сервере

source: Leaderboard has been enabled for this guild!
ru_ru: Лидерборд был включен для этого сервера!

source: Disables League Of Legends leaderboard for this guild
ru_ru: Выключает лидерборд Лиги Легенд на этом сервере

source: Leaderboard has been disabled for this guild!
ru_ru: Лидерборд был выключен для этого сервера!

source: Reload all League of Legends leaderboards
ru_ru: Перезагружает все лидерборды Лиги Легенд

source: Leaderboards in all guilds will be reloaded immediately. The next update will take place in one hour.
ru_ru: Лидерборды во всех серверах будут немедленно перезагружены. Следующее обновление произойдет через 1 час.

source: Returns summoner's last match info
ru_ru: Возвращает информацию о последнем матче призывателя

source: Got error while getting summoner's profile!
ru_ru: Произошла ошибка при попытки получения профиля призывателя!

source: Unexpected error, see logs for details.
ru_ru: Неожиданная ошибка, проверьте логи для подробной информации.

source: Got error while getting summoner's last match!
ru_ru: Произошла ошибка при попытке получения информации о последнем матче призывателя!

source: Can't find any match for you... Maybe you didn't play any?
ru_ru: Не могу найти ни один матч для вас... Возможно, вы не сыграли ни одного?

source: Got error while getting summoner's match info!
ru_ru: Произошла ошибка при попытке получения информации о матче призывателя!

source: Win!
ru_ru: Победа!

source: Defeat!
ru_ru: Поражение!

source: Kills
ru_ru: Убийства

source: Deaths
ru_ru: Смерти

source: Assists
ru_ru: Помощи

source: Position
ru_ru: Позиция

source: Gold spent
ru_ru: Золота потрачено

source: Champion level
ru_ru: Уровень чемпиона

source: First blood
ru_ru: Первая кровь

source: achieved!
ru_ru: получено!

source: First tower
ru_ru: Первая башня

source: Penta Kills!
ru_ru: Пента-киллы!

source: Quadra Kills!
ru_ru: Квадра-киллы!
